/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "0";
"version-sig"	= "FI-070918";

"common-controls-restart"		= "Käynnistä uudelleen";
"common-controls-shutdown"		= "Sammuta";
"common-controls-continue"		= "Jatka";

"common-tab-apple-title"		= " Tietoja ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " Laitteistotestit ";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " Laitteistoprofiili ";	// does look better with spaces at head and tail
"common-version-str"			= "Versio ";
"common-bundle-str"				= "Nippu ";

"mark-graphics-unknown-str"		= "Tuntematon video";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "Asennettu";
"mark-generic-absent-str"		= "Ei löytynyt";
"mark-generic-hasDevice-str"	= "Laite liitetty";
"mark-generic-hasNoDevice-str"	= "Laitetta ei liitetty";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "hertsiä";
"units-byte-short-str"	= "t";
"units-byte-long-str"	= "tavu";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "bittiä";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "volttia";


"units-hour-str"		= " tunti ";
"units-hours-str"		= " tuntia ";
"units-min-str"			= " minuutti ";
"units-mins-str"		= " minuuttia ";
"units-sec-str"			= " sekunti";
"units-secs-str"		= " sekuntia";

"units-kilo-str"		= "k";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= ", ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ".";
"delim-thousds-str"		= ", ";
"delim-space-str"		= " ";
"delim-pct-str"			= " %";

"notcompat-nosupport-str"		= "Apple Hardware Test ei tue tätä tietokonetta.";
"notcompat-ownrisk-str"			= "Jatka omalla vastuulla [vain ennakkojulkaisu].";


"test-head-intro1-text"			= "Apple Hardware Test testaa Macintosh-tietokoneen laitteistoa.";
"test-head-intro2-text"			= "Suorita testit osoittamalla Testi-painiketta tai painamalla T-näppäintä.";

"test-probe-onto-text"			= "Tutkitaan laitteistoa, saattaa kestää jonkin aikaa...";
"test-probe-outof-text"			= "Laitteiston tutkiminen on suoritettu.";

"test-controls-launch"			= "Testi";
"test-controls-interrupt"		= "Lopeta testaus";

"test-choices-title"			= "Testivalinnat";
"test-about-title"				= "Tietoja testeistä ja tuloksista";
"test-results-title"			= "Testitulokset";

"test-results-notestyet"		= "Testejä ei voida suorittaa ennen kuin laitteisto on tutkittu.";
"test-results-nodevfound"		= "Laitteita ei löytynyt.";
"test-results-notyet"			= "Valmis testaukseen.";
"test-results-quick-ongoing"	= "Testaus on käynnissä.";
"test-results-extend-ongoing"	= "Laajennettu testaus on käynnissä.";
"test-results-willstop"			= "Testaus pysäytetään.";
"test-results-interrupted"		= "Testausta ei suoritettu.";
"test-results-nofail"			= "Ongelmia ei löytynyt.";
"test-results-error"			= "Testin aikana tapahtui sisäinen virhe.";
"test-results-failed"			= "Varoitus! Apple Hardware Test on havainnut virheen.";

"test-ongoing-short-status"		= "Testaus on käynnissä.";
"test-ongoing-mlb-status"		= "Testataan emolevyä.";
"test-ongoing-memory-status"	= "Testataan muistia.";
"test-ongoing-storage-status"	= "Testataan tallennustilaa.";
"test-ongoing-video-status"		= "Testataan grafiikkaa.";

"test-ongoing-pass-time-text"	= " testaukseen...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= " testaukseen...";
"test-ongoing-sess-pass-text"	= "Kerran numero: ";
"test-ongoing-sess-time-text"	= "Testauksen kokonaisaika: ";

"test-desc-initial-1-text"	= "Apple Hardware Test on vianmääritystyökalu, jolla voidaan havaita tietokoneen laitteistossa olevia ongelmia.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "Suoritetut testit auttavat määrittämään onko ongelma laitteistossa vai ohjelmistossa.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "Jos testitulokset osoittavat, että laitteistossa ei ole vikaa, jatka vianmääritystä tutustumalla tietokoneen käyttöoppaaseen tai ohjeisiin.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "Arvioitu jäljellä oleva aika: 3 minuuttia tai enemmän riippuen asennetun muistin määrästä.";	/* default */
"test-desc-intro-quick-text2"	= "Arvioitu jäljellä oleva aika: 10 - 15 sekuntia tai enemmän riippuen asennetun muistin määrästä.";
"test-desc-intro-quick-text3"	= "Arvioitu jäljellä oleva aika: 2 minuuttia tai enemmän riippuen asennetun muistin määrästä.";
"test-desc-intro-quick-text4"	= "Arvioitu jäljellä oleva aika: 4 minuuttia tai enemmän riippuen asennetun muistin määrästä.";

"test-desc-intro-extend-text"	= "Arvioitu jäljellä oleva aika: 1 tunti tai enemmän riippuen asennetun muistin määrästä.";	/* default */
"test-desc-intro-extend-text2"	= "Arvioitu jäljellä oleva aika: 10 - 15 minuuttia tai enemmän riippuen asennetun muistin määrästä.";
"test-desc-intro-extend-text3"	= "Arvioitu jäljellä oleva aika: 30 minuuttia tai enemmän riippuen asennetun muistin määrästä.";
"test-desc-intro-extend-text4"	= "Arvioitu jäljellä oleva aika: 2 tuntia tai enemmän riippuen asennetun muistin määrästä.";

"test-desc-option-extend-text"	= "Suorita laajennettu testaus (kestää huomattavasti pidempään).";
"test-desc-option-loop-text"	= "Silmukointi päällä.";

"test-desc-quick-running-1-text"	= "Testaus on käynnissä...";
"test-desc-quick-running-2-text"	= "Voit lopettaa osoittamalla Lopeta testaus -painiketta.";
"test-desc-quick-running-3-text"	= "Tai osoita komento-painiketta (Apple-painike) ja pistettä samanaikaisesti.";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "Laajennettu testaus on käynnissä...";
"test-desc-extend-running-2-text"	= "Voit lopettaa osoittamalla Lopeta testaus -painiketta.";
"test-desc-extend-running-3-text"	= "Tai osoita komento-painiketta (Apple-painike) ja pistettä samanaikaisesti.";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "Varoitus! Apple Hardware Test on havainnut virheen.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "Kirjoita ensin ylös Testitulokset-alueella oleva virhekoodi.";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "Toiseksi, jos tietokoneeseen on liitetty lisälaitteita, sammuta tietokone, irrota lisälaitteet ja varmista tulokset suorittamalla laajennettu testi.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "Jos virhe raportoidaan edelleen, ota yhteyttä AppleCareen tietokoneen mukana tulleen huolto- ja tukimateriaalin ohjeiden avulla.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "Varoitus! Apple Hardware Test havaitsi virheen käynnistyessään.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "Kirjoita ensin ylös Testitulokset-alueella olevat virhekoodit.";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "Toiseksi, jos tietokoneeseen on liitetty lisälaitteita, sammuta tietokone, irrota lisälaitteet ja varmista tulokset suorittamalla laajennettu testi.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "Jos virhe raportoidaan edelleen, ota yhteyttä AppleCareen tietokoneen mukana tulleen huolto- ja tukimateriaalin ohjeiden avulla.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "Tuote";
"prof-prod-group-subtitle"		= "Tuotteen tiedot:";
"prof-prod-name-label"			= "Macintosh-nimi:";
"prof-prod-model-label"			= "Macintosh-malli:";
"prof-prod-cputype-label"		= "Prosessorin tyyppi:";
"prof-prod-cpucount-label"		= "Prosessorien määrä:";
"prof-prod-cpucoretotal-label"	= "Ydinten kokonaismäärä:";
"prof-prod-cpucorecount-label"	= "Ydinten määrä:";
"prof-prod-cpuspeed-label"		= "Prosessorin nopeus:";
"prof-prod-cpucache-label"		= "L2-prosessorivälimuisti (prosessoria kohden):";

"prof-prod-L2cache-label"		= "L2-välimuisti:";
"prof-prod-L2cachecore-label"	= "L2-välimuisti (ydintä kohden):";
"prof-prod-L3cache-label"		= "L3-välimuisti:";

"prof-prod-cpucache3-label"		= "L3-välimuisti (keskusyksikköä kohden)";
"prof-prod-mlb-sn-label"		= "Emolevyn sarjanumero:";
"prof-processor-tray-sn-label"	= "Prosessorialustan sarjanumero:";

"prof-graph-group-title"		= "Video";
"prof-graph-group-subtitle"		= "Videon tiedot:";
"prof-graph-chipset-label"		= "Grafiikka:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "Näytön leveys (pikseliä):";
"prof-graph-disp-height-label"	= "Näytön korkeus (pikseliä):";

"prof-communi-group-title"		= "Tietoliikenne";
"prof-communi-group-subtitle"	= "Tietoliikenteen tiedot:";
"prof-communi-enet-mac-label"	= "Ethernetin MAC-osoite:";
"prof-communi-fwire-mac-label"	= "FireWiren MAC-osoite:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "Infrapunavastaanotin:";
"prof-communi-usb1-connect-label"	= "USB-portti 1:";
"prof-communi-usb2-connect-label"	= "USB-portti 2:";
"prof-communi-usb3-connect-label"	= "USB-portti 3:";
"prof-communi-usb4-connect-label"	= "USB-portti 4:";

"prof-memo-group-title"			= "Muisti";
"prof-memo-group-subtitle"		= "Muistin tiedot:";
"prof-memo-overview-label"		= "Yleiskatsaus";
"prof-memo-slot-1-label"		= "Muisti 1";
"prof-memo-slot-2-label"		= "Muisti 2";
"prof-memo-slot-3-label"		= "Muisti 3";
"prof-memo-slot-4-label"		= "Muisti 4";
"prof-memo-slot-5-label"		= "Muisti 5";
"prof-memo-slot-6-label"		= "Muisti 6";
"prof-memo-slot-7-label"		= "Muisti 7";
"prof-memo-slot-8-label"		= "Muisti 8";

"prof-memo-type-str"			= "SDRAM kiinteä";
"prof-memo--str"				= "Tuntematon";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " Syklin pituus (ns)";
"prof-memo-ct2-str"				= " Sykli (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Rev.";
"prof-memo-paired-str"			= "Pari kanssa #";
"prof-memo-paired-not-str"		= "  ei pari";
"prof-memo-mismatch-label"		= "Epävastaavuus:";
"prof-memo-size-str"			= " koko";
"prof-memo-speed-str"			= " nopeus";
"prof-memo-vendor-str"			= " valmistaja";
"prof-memo-recommend-str"		= "Suositus: ";
"prof-memo-post-fail-str"		= "POST-virhe";

"prof-board-group-title"		= "Emolevy";
"prof-board-brom-vers-label"	= "Boot ROM -versio:";
"prof-board-smc-vers-label"		= "SMC-versio:";
"prof-board-syst-sn-label"		= "Järjestelmän sarjanumero:";
"prof-board-bootdev-label"		= "Oletuskäynnistyslaite:";

"prof-stor-group-title"			= "Tallennus";
"prof-stor-size-label"			= "Koko:";

"prof-powr-group-title"			= "Virta";
"prof-powr-group-subtitle"		= "Virtatiedot:";
"prof-powr-src-label"			= "Voimanlähde:";
"prof-powr-src-wall-str"		= "Virtalähde";
"prof-powr-src-batt-str"		= "Akku";
"prof-powr-ac-on-str"			= "Liitetty";
"prof-powr-ac-off-str"			= "Ei liitetty";
"prof-powr-capac-label"			= "Kapasiteetti:";
"prof-powr-volt-label"			= "Jännite:";
"prof-powr-status-label"		= "Tila:";

